--liquibase formatted sql

--changeset re1kur:1
-- =========================
-- Marks (makes)
-- =========================
INSERT INTO makes (name)
VALUES ('Toyota'),
       ('Hyundai'),
       ('Kia'),
       ('Lada'),
       ('Volkswagen'),
       ('Skoda'),
       ('Renault'),
       ('Nissan'),
       ('Ford'),
       ('BMW'),
       ('Mercedes-Benz'),
       ('Audi'),
       ('Chevrolet'),
       ('Mazda'),
       ('Mitsubishi'),
       ('Honda'),
       ('Lexus'),
       ('Peugeot'),
       ('Suzuki'),
       ('Geely');

--changeset re1kur:2

-- =========================
-- Regions
-- =========================
INSERT INTO regions (id, name)
VALUES (1, 'Москва'),
       (2, 'Санкт-Петербург'),
       (3, 'Московская область'),
       (4, 'Краснодарский край'),
       (5, 'Свердловская область'),
       (6, 'Ростовская область'),
       (7, 'Республика Татарстан'),
       (8, 'Челябинская область'),
       (9, 'Нижегородская область'),
       (10, 'Башкортостан'),
       (11, 'Самарская область'),
       (12, 'Новосибирская область'),
       (13, 'Ставропольский край'),
       (14, 'Красноярский край'),
       (15, 'Иркутская область'),
       (16, 'Воронежская область'),
       (17, 'Волгоградская область'),
       (18, 'Ханты-Мансийский АО'),
       (19, 'Пермский край'),
       (20, 'Алтайский край');

-- changeset re1kur:3

-- =========================
-- Region codes
-- =========================

INSERT INTO region_codes (code, region_id)
VALUES
-- Москва
('77', 1),
('97', 1),
('99', 1),
('177', 1),
('197', 1),
('199', 1),
('777', 1),
('799', 1),
-- Санкт-Петербург
('78', 2),
('98', 2),
('178', 2),
('198', 2),
-- Московская область
('50', 3),
('90', 3),
('150', 3),
('190', 3),
('750', 3),
('790', 3),
-- Краснодарский край
('23', 4),
('93', 4),
('123', 4),
('193', 4),
-- Свердловская область
('66', 5),
('96', 5),
('196', 5),
-- Ростовская область
('61', 6),
('161', 6),
-- Татарстан
('16', 7),
('116', 7),
('716', 7),
-- Челябинская область
('74', 8),
('174', 8),
-- Нижегородская область
('52', 9),
('152', 9),
-- Башкортостан
('02', 10),
('102', 10),
('702', 10),
-- Самарская область
('63', 11),
('163', 11),
-- Новосибирская область
('54', 12),
('154', 12),
-- Ставропольский край
('26', 13),
('126', 13),
-- Красноярский край
('24', 14),
('124', 14),
-- Иркутская область
('38', 15),
('138', 15),
-- Воронежская область
('36', 16),
('136', 16),
-- Волгоградская область
('34', 17),
('134', 17),
-- Ханты-Мансийский АО
('86', 18),
('186', 18),
-- Пермский край
('59', 19),
('159', 19),
-- Алтайский край
('22', 20),
('122', 20);